--- a/docs/oauth2.md
+++ b/docs/oauth2.md
@@ -1,21 +1,108 @@
-```mermaid
-sequenceDiagram
+```plantuml
 autonumber
-participant ua as User Agent
-%% The only difference between actor
-%% and participant is the drawing
-participant ca as Client Application
-participant  as as "Authorization Server"
-participant  rs as "Resource Server"
-%% You can also declare
-ua ->> ca: Request a  Resource 
-ca ->> as: Auth Code Request
-as -->> ua : Login Page
-ua ->> as : User Login
-as -->> ca : Auth Code
-ca ->> as : Exchange Code for Token
-as -->> ca : Access Token
-ca ->> rs : Api call with Access Token
-rs -->> as : validate Token
-rs -->> ca : Api Response if token valid
+participant  "User \n Agent" as ua
+' The only difference between actor
+' and participant is the drawing
+participant  "Client \n Application" as ca
+participant   "Authorization \n Server" as as
+participant   "Resource \n Server" as rs
+' You can also declare
+ua --> ca: Request a  Resource 
+ca --> as: Auth Code Request
+as --> ua : Login Page
+ua --> as : User Login
+as --> ca : Auth Code
+ca --> as : Exchange Code for Token
+as --> ca : Access Token
+ca --> rs : Api call with Access Token
+rs --> as : validate Token
+rs --> ca : Api Response if token valid
+```
+---
+```plantuml
+autonumber
@@
 ```
